package com.ar.siosi.Hackfair.mixare.gui;

/**
 * Created by joyeongje on 2016. 9. 9..
 */
public class paintarscreen {
    // TODO: 2016. 9. 9. mansu
    // TODO: 2016. 9. 9. 정보전달용 아마 ar화면 위에 버튼을 만들어서 클릭하는걸로 하고 싶으면 gui 패키지들을 분석해서 구현해야될거임
    // TODO: 2016. 9. 9. 회의때나온내용 ar 화면에 버튼이나 마커를 띄우고 그걸 클릭했을대 이벤트 처리되는거. 마커는 띄워지는데 버튼을 어떻게 구현할지 모르겠음
    // TODO: 2016. 9. 9. 헷갈릴가봐 공지하는건데 정보전달용으로 임시로 만든거지 니가 구현할거면 여기에 구현하든 기존 gui 클래스를 분석하든 알아서해야될듯
    // TODO: 2016. 9. 9. 기존 마커를 클릭했을때 다이얼로그 띄우게 되는 원리 찾고 싶으면 소스코드 전체검색해서 fclick 이라는 함수 찾아보시길 이거 찾아서 분석하면
    // TODO: 2016. 9. 9. 이벤트 등록부터 처리까지 다 나와있음

}
